# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLOv8 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolov8
# Task docs: https://docs.ultralytics.com/tasks/detect

nc: 18 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
 s: [0.33, 0.50, 1024]  # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs

ch: 3

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, DSConv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, DSConv, [128, 3, 2]] # 1-P2/4
  - [-1, 3,C2f_DRB, [128, True]]
  - [-1, 1, DSConv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f_DRB, [256, True]]
  - [-1, 1, DSConv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f_DRB, [512, True]]
  - [-1, 1, DSConv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C2f_DRB, [1024,True]]
  - [-1, 1, SPPF, [1024, 5]] # 9

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 3,  C2f_DRB, [512]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f_DRB, [256]]

  - [-1, 1,DSConv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # cat head P4
  - [-1, 3,  C2f_DRB, [512]]
  - [-1, 1,  LSKblock, [512]]

  - [-1, 1, DSConv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]] # cat head P5
  - [-1, 3,  C2f_DRB, [1024]]
  - [-1, 1,  LSKblock, [1024]]

  - [[15, 19, 23], 1,Detect, [nc]] # Detect(P3, P4, P5)
