# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLOv8 with INR-Enhanced C2f for VisDrone Dataset
# Optimized for small object detection in drone imagery
# VisDrone dataset contains vehicles, pedestrians, and other small objects

# Parameters
nc: 10 # VisDrone has 10 classes: ignored regions, pedestrian, people, bicycle, car, van, truck, tricycle, awning-tricycle, bus, motor, others
scales: # model compound scaling constants
  # [depth, width, max_channels]
  #n: [0.33, 0.25, 1024] # YOLOv8n - lightweight for faster inference
  #s: [0.33, 0.50, 1024] # YOLOv8s - balanced performance
  m: [0.67, 0.75, 768]  # YOLOv8m - recommended for VisDrone
  l: [1.00, 1.00, 512]  # YOLOv8l - high accuracy
  x: [1.00, 1.25, 512]  # YOLOv8x - maximum accuracy

# YOLOv8 backbone with INR-Enhanced C2f optimized for VisDrone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, INREnhancedC2f, [128, True, 1, 0.5, True, True, 96]] # 2 - Enhanced for small objects
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, INREnhancedC2f, [256, True, 1, 0.5, True, True, 128]] # 4 - Medium scale objects
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, INREnhancedC2f, [512, True, 1, 0.5, True, True, 160]] # 6 - Large scale objects
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, INREnhancedC2f, [1024, True, 1, 0.5, True, True, 192]] # 8 - Very large scale
  - [-1, 1, SPPF, [1024, 5]] # 9

# YOLOv8 head with INR-Enhanced C2f optimized for VisDrone
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, INREnhancedC2f, [512, 1, False, 1, 0.5, True, True, 160]] # 12 - P4/16-medium

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, INREnhancedC2f, [256, 1, False, 1, 0.5, True, True, 128]] # 15 (P3/8-small) - Critical for small objects

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # cat head P4
  - [-1, 2, INREnhancedC2f, [512, 1, False, 1, 0.5, True, True, 160]] # 18 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]] # cat head P5
  - [-1, 2, INREnhancedC2f, [1024, 1, False, 1, 0.5, True, True, 192]] # 21 (P5/32-large)

  - [[15, 18, 21], 1, Detect, [nc]] # Detect(P3, P4, P5)
