# Ultralytics YOLOv11 + LNN液态神经网络模块配置（自适应版本）
# 使用Adaptive版本，结合双重融合机制

# Parameters
nc: 18 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  s: [0.50, 0.50, 1024] # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs

ch: 3

# YOLOv11n backbone with C2Liquid_Adaptive and LiquidSPPF modules
backbone:
  # [from, repeats, module, args]
  # C2Liquid_Adaptive args格式: [c1, c2, n, shortcut, g, e, use_lightweight]
  - [ -1, 1, Conv, [ 64, 3, 2 ] ] # 0-P1/2
  - [ -1, 1, Conv, [ 128, 3, 2 ] ] # 1-P2/4
  - [ -1, 3, C2f, [ 128, True ] ]
  - [ -1, 1, Conv, [ 256, 3, 2 ] ] # 3-P3/8
  - [ -1, 6, C2f, [ 256, True ] ]
  - [ -1, 1, Conv, [ 512, 3, 2 ] ] # 5-P4/16
  - [ -1, 6, C2f, [ 512, True ] ]
  - [ -1, 1, Conv, [ 1024, 3, 2 ] ] # 7-P5/32
  - [ -1, 3, C2f, [ 1024, True ] ]
  - [-1, 1, SPPF, [1024, 5]]

# YOLOv11n head with C2Liquid_Adaptive modules
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 10
  - [[-1, 6], 1, Concat, [1]]  # 11 - cat backbone P4
  - [-1, 3, C2f, [512, False]]   # 12 - C2Liquid模块

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 13
  - [[-1, 4], 1, Concat, [1]]  # 14 - cat backbone P3
  - [-1, 3, C2f, [256, False]]  # 15 - C2Liquid_Lite模块

  - [-1, 1, Conv, [256, 3, 2]]  # 16
  - [[-1, 12], 1, Concat, [1]] # 17 - cat head P4
  - [-1, 3, C2f, [512, False]]   # 18 - C2Liquid_Adaptive模块

  - [-1, 1, Conv, [512, 3, 2]]  # 19
  - [[-1, 9], 1, Concat, [1]] # 20 - cat head P5
  - [-1, 3, C2f, [1024, False]]  # 21 - C2Liquid_Adaptive模块

  - [[15, 18, 21], 1, Detect, [nc]]  # 22 - Detect(P3, P4, P5)

